brew "direnv"
brew "rbenv"
brew "grc"
brew "hub"
brew "gh"
brew "go"
brew "node"
brew "graphviz" # for dot & tree-sitter grammar development
brew "jq"
brew "tree"
brew "git"
brew "zsh"
brew "coreutils"
brew "md5sha1sum"
brew "openssh"
brew "python3"
brew "ipython"
brew "azure-cli"

# Development tools
cask "github"
cask "visual-studio-code"
cask "sublime-text"

# General apps
cask "1Password"
# cask "arq" # note: need arq 5 for now
brew "gmailctl"
# cask "divvy"
cask "google-chrome"
cask "slack"
cask "spotify"
cask "zoom"
cask "notunes" #stop the rage-inducing opening of Apple Music by my bluetooth headphones
# Extras (non-essential)
# cask "graphiql"
# cask "balenaetcher"
# cask "arduino"
# cask "steam"
